-- phpMyAdmin SQL Dump
-- version 4.6.6deb4
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: May 09, 2019 at 02:03 PM
-- Server version: 5.6.38
-- PHP Version: 7.0.27-0+deb9u1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `camp_s60_60160027`
--

-- --------------------------------------------------------

--
-- Table structure for table `prefix`
--

CREATE TABLE `prefix` (
  `pf_id` int(11) NOT NULL COMMENT 'รหัส',
  `pf_name` varchar(50) NOT NULL COMMENT 'ชื่อเต็ม(ไทย)',
  `pf_name_en` varchar(50) NOT NULL COMMENT 'ชื่อเต็ม(อังกฤษ)',
  `pf_name_abbr` varchar(50) NOT NULL COMMENT 'ชื่อย่อ(ไทย)',
  `pf_name_abbr_en` varchar(50) NOT NULL COMMENT 'ชื่อย่อ(อังกฤษ)',
  `pf_gd_id` int(11) NOT NULL COMMENT 'รหัสจากตาราง hr_gender',
  `pf_pftype_id` int(11) NOT NULL DEFAULT '1' COMMENT 'ประเภทคำนำหน้า (ตาราง hr_prefix_type)',
  `pf_seq_no` int(11) NOT NULL COMMENT 'ลำดับการแสดงผล',
  `pf_active` char(1) NOT NULL COMMENT 'สถานะการถูกลบ(Y=ไม่ถูกลบ N=ถูกลบแล้ว)'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='คำนำหน้าชื่อ/ยศ';

--
-- Dumping data for table `prefix`
--

INSERT INTO `prefix` (`pf_id`, `pf_name`, `pf_name_en`, `pf_name_abbr`, `pf_name_abbr_en`, `pf_gd_id`, `pf_pftype_id`, `pf_seq_no`, `pf_active`) VALUES
(1, 'นาย', 'Mister', 'นาย', 'Mr.', 2, 1, 1, 'Y'),
(2, 'นางสาว', 'Miss', 'นางสาว', 'Ms.', 3, 1, 2, 'Y'),
(3, 'นาง', 'Mistress', 'นาง', 'Mrs.', 3, 1, 3, 'Y'),
(4, 'เด็กหญิง', '-', 'ด.ญ.', '-', 3, 0, 4, 'Y'),
(5, 'เด็กชาย', '-', 'ด.ช.', '-', 2, 0, 5, 'Y'),
(6, 'พลทหาร', 'SEAMAN', 'พลฯ', 'SEA-MAN', 1, 0, 6, 'Y'),
(7, 'จ่าตรี', 'Petty Officer Third CLASS', 'จ.ต.', 'PO 3', 2, 0, 7, 'Y'),
(8, 'จ่าโท', 'Petty Officer Second Class', 'จ.ท.', 'PO 2', 2, 0, 8, 'Y'),
(9, 'จ่าเอก', 'Petty Officer First Class', 'จ.อ.', 'PO 1', 2, 0, 9, 'Y'),
(10, 'จ่าตรีหญิง', 'Petty Officer Third CLASS', 'จ.ต.หญิง', 'PO 3', 3, 0, 10, 'Y'),
(11, 'จ่าโทหญิง', 'Petty Officer Second Class', 'จ.ท.หญิง', 'PO 2', 3, 0, 11, 'Y'),
(12, 'จ่าเอกหญิง', 'Petty Officer First Class', 'จ.อ.หญิง', 'PO 1', 3, 0, 12, 'Y'),
(13, 'พันจ่าตรี', 'Chief Petty Officer Third CLASS', 'พ.จ.ต.', 'CPO 3', 2, 0, 13, 'Y'),
(14, 'พันจ่าโท', 'Chief Petty Officer Second Class', 'พ.จ.ท.', 'CPO 2', 2, 0, 14, 'Y'),
(15, 'พันจ่าเอก', 'Chief Petty Officer First Class', 'พ.จ.อ.', 'CPO 1', 2, 0, 15, 'Y'),
(16, 'พันจ่าตรีหญิง', 'Chief Petty Officer Third CLASS', 'พ.จ.ต.หญิง', 'CPO 3', 3, 0, 16, 'Y'),
(17, 'พันจ่าโทหญิง', 'Chief Petty Officer Second Class', 'พ.จ.ท.หญิง', 'CPO 2', 3, 0, 17, 'Y'),
(18, 'พันจ่าเอกหญิง', 'Chief Petty Officer First Class', 'พ.จ.อ.หญิง', 'CPO 1', 3, 0, 18, 'Y'),
(19, 'เรือตรี', 'Sub-Lieutenant', 'ร.ต.(ร.น.)', 'SUB LT', 2, 0, 19, 'Y'),
(20, 'เรือโท', 'Junior Lieutenant', 'ร.ท.(ร.น.)', 'JLT', 2, 0, 20, 'Y'),
(21, 'เรือเอก', 'Lieutenant', 'ร.อ.(ร.น.)', 'LT', 2, 0, 21, 'Y'),
(22, 'เรือตรีหญิง', 'Sub-Lieutenant', 'ร.ต.(ร.น.)หญิง', 'SUB LT', 3, 0, 22, 'Y'),
(23, 'เรือโทหญิง', 'Junior Lieutenant', 'ร.ท.(ร.น.)หญิง', 'JLT', 3, 0, 23, 'Y'),
(24, 'เรือเอกหญิง', 'Lieutenant', 'ร.อ.(ร.น.)หญิง', 'LT', 3, 0, 24, 'Y'),
(25, 'นาวาตรี', 'Lieutenant Commander', 'น.ต.(ร.น.)', 'L CDR', 2, 0, 25, 'Y'),
(26, 'นาวาโท', 'Commander', 'น.ท.(ร.น.)', 'CDR', 2, 0, 26, 'Y'),
(27, 'นาวาเอก', 'Captain', 'น.อ.(ร.น.)', 'CAPT', 2, 0, 27, 'Y'),
(28, 'นาวาตรีหญิง', 'Lieutenant Commander', 'น.ต.(ร.น.)หญิง', 'L CDR', 3, 0, 28, 'Y'),
(29, 'นาวาโทหญิง', 'Commander', 'น.ท.(ร.น.)หญิง', 'CDR', 3, 0, 29, 'Y'),
(30, 'นาวาเอกหญิง', 'Captain', 'น.อ.(ร.น.)หญิง', 'CAPT', 3, 0, 30, 'Y'),
(31, 'พลเรือตรี', 'Rear Admiral', 'พล.ร.ต.', 'RADM', 2, 0, 31, 'Y'),
(32, 'พลเรือโท', 'Vice Admiral', 'พล.ร.ท.', 'VADM', 2, 0, 32, 'Y'),
(33, 'พลเรือเอก', 'Admiral', 'พล.ร.อ.', 'ADM', 2, 0, 33, 'Y'),
(34, 'พลเรือตรีหญิง', 'Rear Admiral', 'พล.ร.ต.หญิง', 'RADM', 3, 0, 34, 'Y'),
(35, 'พลเรือโทหญิง', 'Vice Admiral', 'พล.ร.ท.หญิง', 'VADM', 3, 0, 35, 'Y'),
(36, 'พลเรือเอกหญิง', 'Admiral', 'พล.ร.อ.หญิง', 'ADM', 3, 0, 36, 'Y'),
(37, 'ว่าที่เรือตรี', '-', 'ว่าที่ ร.ต.(ร.น.)', '-', 2, 0, 37, 'Y'),
(38, 'ว่าที่เรือตรีหญิง', '-', 'ว่าที่ ร.ต.หญิง(ร.น.)', '-', 3, 0, 38, 'Y'),
(39, 'จ่าอากาศตรี', 'Leading Aircraft man', 'จ.ต.', 'LAC', 2, 0, 39, 'Y'),
(40, 'จ่าอากาศโท', 'Corporal', 'จ.ท.', 'CPL', 2, 0, 40, 'Y'),
(41, 'จ่าอากาศเอก', 'Sergeant', 'จ.อ.', 'SGT', 2, 0, 41, 'Y'),
(42, 'จ่าอากาศตรีหญิง', 'Leading Aircraft man', 'จ.ต.หญิง', 'LAC', 3, 0, 42, 'Y'),
(43, 'จ่าอากาศโทหญิง', 'Corporal', 'จ.ท.หญิง', 'CPL', 3, 0, 43, 'Y'),
(44, 'จ่าอากาศเอกหญิง', 'Sergeant', 'จ.อ.หญิง', 'SGT', 3, 0, 44, 'Y'),
(45, 'พันจ่าอากาศตรี', 'Flight Sergeant Third Class', 'พ.อ.ต.', 'FS 3', 2, 0, 45, 'Y'),
(46, 'พันจ่าอากาศโท', 'Flight Sergeant Second Class', 'พ.อ.ท.', 'FS 2', 2, 0, 46, 'Y'),
(47, 'พันจ่าอากาศเอก', 'Flight Sergeant First Class', 'พ.อ.อ.', 'FS 1', 2, 0, 47, 'Y'),
(48, 'พันจ่าอากาศตรีหญิง', 'Flight Sergeant Third Class', 'พ.อ.ต.หญิง', 'FS 3', 3, 0, 48, 'Y'),
(49, 'พันจ่าอากาศโทหญิง', 'Flight Sergeant Second Class', 'พ.อ.ท.หญิง', 'FS 2', 3, 0, 49, 'Y'),
(50, 'พันจ่าอากาศเอกหญิง', 'Flight Sergeant First Class', 'พ.อ.อ.หญิง', 'FS 1', 3, 0, 50, 'Y'),
(51, 'เรืออากาศตรี', 'Pilot Officer', 'ร.ต.', 'Plt Off', 2, 0, 51, 'Y'),
(52, 'เรืออากาศโท', 'Flying Officer', 'ร.ท.', 'Flg Off', 2, 0, 52, 'Y'),
(53, 'เรืออากาศเอก', 'Flight Lieutenant', 'ร.อ.', 'Flt Lt', 2, 0, 53, 'Y'),
(54, 'เรืออากาศตรีหญิง', 'Pilot Officer', 'ร.ต.หญิง', 'Plt Off', 3, 0, 54, 'Y'),
(55, 'เรืออากาศโทหญิง', 'Flying Officer', 'ร.ท.หญิง', 'Flg Off', 3, 0, 55, 'Y'),
(56, 'เรืออากาศเอกหญิง', 'Flight Lieutenant', 'ร.อ.หญิง', 'Flt Lt', 3, 0, 56, 'Y'),
(57, 'นาวาอากาศตรี', 'Squadron Leader', 'น.ต.', 'Sqn Ldr', 2, 0, 57, 'Y'),
(58, 'นาวาอากาศโท', 'Wing Commander', 'น.ท.', 'Wng Cdr', 2, 0, 58, 'Y'),
(59, 'นาวาอากาศเอก', 'Group Captain', 'น.อ.', 'Gp Capt', 2, 0, 59, 'Y'),
(60, 'นาวาอากาศตรีหญิง', 'Squadron Leader', 'น.ต.หญิง', 'Sqn Ldr', 3, 0, 60, 'Y'),
(61, 'นาวาอากาศโทหญิง', 'Wing Commander', 'น.ท.หญิง', 'Wng Cdr', 3, 0, 61, 'Y'),
(62, 'นาวาอากาศเอกหญิง', 'Group Captain', 'น.อ.หญิง', 'Gp Capt', 3, 0, 62, 'Y'),
(63, 'พลอากาศตรี', 'Air Vice Marshal', 'พล.อ.ต.', 'AVM', 2, 0, 63, 'Y'),
(64, 'พลอากาศโท', 'Air Marshal', 'พล.อ.ท.', 'AM', 2, 0, 64, 'Y'),
(65, 'พลอากาศเอก', 'Air Chief Marshal', 'พล.อ.อ.', 'ACM', 2, 0, 65, 'Y'),
(66, 'พลอากาศตรีหญิง', 'Air Vice Marshal', 'พล.อ.ต.หญิง', 'AVM', 3, 0, 66, 'Y'),
(67, 'พลอากาศโทหญิง', 'Air Marshal', 'พล.อ.ท.หญิง', 'AM', 3, 0, 67, 'Y'),
(68, 'พลอากาศเอกหญิง', 'Air Chief Marshal', 'พล.อ.อ.หญิง', 'ACM', 3, 0, 68, 'Y'),
(69, 'ว่าที่เรืออากาศตรี', '-', 'ว่าที่ ร.ต.', '-', 2, 0, 69, 'Y'),
(70, 'ว่าที่เรืออากาศตรีหญิง', '-', 'ว่าที่ ร.ต.หญิง', '-', 3, 0, 70, 'Y'),
(71, 'พลทหาร', 'Airman', 'พลฯ', 'AMN', 1, 0, 71, 'Y'),
(72, 'สิบตรี', 'Lance Corporal', 'ส.ต.', 'LCPL / SP5', 2, 0, 72, 'Y'),
(73, 'สิบโท', 'Corporal', 'ส.ท.', 'CPL / SP6', 2, 0, 73, 'Y'),
(74, 'สิบเอก', 'Sergeant', 'ส.อ.', 'SGT', 2, 0, 74, 'Y'),
(75, 'สิบตรีหญิง', 'Lance Corporal', 'ส.ต.หญิง', 'LCPL', 3, 0, 75, 'Y'),
(76, 'สิบโทหญิง', 'Corporal', 'ส.ท.หญิง', 'CPL / SP6', 3, 0, 76, 'Y'),
(77, 'สิบเอกหญิง', 'Sergeant', 'ส.อ.หญิง', 'SGT', 3, 0, 77, 'Y'),
(78, 'จ่าสิบตรี', 'Master Sergeant Third Class', 'จ.ส.ต.', '3MSGT / SFC', 2, 0, 78, 'Y'),
(79, 'จ่าสิบโท', 'Master Sergeant Second Class', 'จ.ส.ท.', '2MSGT / MSG', 2, 0, 79, 'Y'),
(80, 'จ่าสิบเอก', 'Master Sergeant First Class', 'จ.ส.อ.', '1MSGT / SMG', 2, 0, 80, 'Y'),
(81, 'จ่าสิบตรีหญิง', 'Master Sergeant Third Class', 'จ.ส.ต.หญิง', '3MSGT / SFC', 3, 0, 81, 'Y'),
(82, 'จ่าสิบโทหญิง', 'Master Sergeant Second Class', 'จ.ส.ท.หญิง', '2MSGT / MSG', 3, 0, 82, 'Y'),
(83, 'จ่าสิบเอกหญิง', 'Master Sergeant First Class', 'จ.ส.อ.หญิง', '1MSGT / SMG', 3, 0, 83, 'Y'),
(84, 'ร้อยตรี', 'Second Lieutenant', 'ร.ต.', '2Lt.', 2, 0, 84, 'Y'),
(85, 'ร้อยโท', 'First Lieutenant', 'ร.ท.', 'Lt.', 2, 0, 85, 'Y'),
(86, 'ร้อยเอก', 'Captain', 'ร.อ.', 'Capt.', 2, 0, 86, 'Y'),
(87, 'ร้อยตรีหญิง', 'Second Lieutenant', 'ร.ต.หญิง', '2Lt.', 3, 0, 87, 'Y'),
(88, 'ร้อยโทหญิง', 'First Lieutenant', 'ร.ท.หญิง', 'Lt.', 3, 0, 88, 'Y'),
(89, 'ร้อยเอกหญิง', 'Captain', 'ร.อ.หญิง', 'Capt.', 3, 0, 89, 'Y'),
(90, 'พันตรี', 'Major', 'พ.ต.', 'MAJ', 2, 0, 90, 'Y'),
(91, 'พันโท', 'Lieutenant Colonel', 'พ.ท.', 'Lt.Col.', 2, 0, 91, 'Y'),
(92, 'พันเอก', 'Colonel', 'พ.อ.', 'Col.', 2, 0, 92, 'Y'),
(93, 'พันตรีหญิง', 'Major', 'พ.ต.หญิง', 'MAJ', 3, 0, 93, 'Y'),
(94, 'พันโทหญิง', 'Lieutenant Colonel', 'พ.ท.หญิง', 'Lt.Col.', 3, 0, 94, 'Y'),
(95, 'พันเอกหญิง', 'Colonel', 'พ.อ.หญิง', 'Col.', 3, 0, 95, 'Y'),
(96, 'พลตรี', 'Major General', 'พล.ต.', 'Maj.Gen.', 2, 0, 96, 'Y'),
(97, 'พลโท', 'Lieutenant General', 'พล.ท.', 'Lt.Gen.', 2, 0, 97, 'Y'),
(98, 'พลเอก', 'General', 'พล.อ.', 'Gen.', 2, 0, 98, 'Y'),
(99, 'พลตรีหญิง', 'Major General', 'พล.ต.หญิง', 'Maj.Gen.', 3, 0, 99, 'Y'),
(100, 'พลโทหญิง', 'Lieutenant General', 'พล.ท.หญิง', 'Lt.Gen.', 3, 0, 100, 'Y'),
(101, 'พลเอกหญิง', 'General', 'พล.อ.', 'Gen.', 3, 0, 101, 'Y'),
(102, 'ว่าที่สิบเอก', '-', 'ว่าที่ ส.อ.', '-', 2, 0, 102, 'Y'),
(103, 'ว่าที่สิบเอกหญิง', '-', 'ว่าที่ ส.อ.หญิง', '-', 3, 0, 103, 'Y'),
(104, 'ว่าที่จ่าสิบเอก', '-', 'ว่าที่ จ.ส.อ.', '-', 2, 0, 104, 'Y'),
(105, 'ว่าที่จ่าสิบเอกหญิง', '-', 'ว่าที่ จ.ส.อ.หญิง', '-', 3, 0, 105, 'Y'),
(106, 'ว่าที่ร้อยตรี', 'Acting 2,Lt.', 'ว่าที่ ร.ต.', 'Acting Sub Lt.', 2, 0, 106, 'Y'),
(107, 'ว่าที่ร้อยตรีหญิง', '-', 'ว่าที่ ร.ต.หญิง', 'Acting Sub Lt.', 3, 0, 107, 'Y'),
(108, 'ว่าที่ร้อยโท', '-', 'ว่าที่ ร.ท.', 'Acting Lt.', 2, 0, 108, 'Y'),
(109, 'ว่าที่ร้อยโทหญิง', '-', 'ว่าที่ ร.ท.หญิง', 'Acting Lt.', 3, 0, 109, 'Y'),
(110, 'พลทหาร', 'Private', 'พลฯ', 'PVT', 1, 0, 110, 'Y'),
(111, 'สิบตำรวจตรี', 'Police Lance Corporal', 'ส.ต.ต.', 'POL.L / C', 2, 0, 111, 'Y'),
(112, 'สิบตำรวจโท', 'Police Corporal', 'ส.ต.ท.', 'POL.CPL.', 2, 0, 112, 'Y'),
(113, 'สิบตำรวจเอก', 'Police Sergeant', 'ส.ต.อ.', 'POL.SGT', 2, 0, 113, 'Y'),
(114, 'สิบตำรวจตรีหญิง', 'Police Lance Corporal', 'ส.ต.ต.หญิง', 'POL.L / C', 3, 0, 114, 'Y'),
(115, 'สิบตำรวจโทหญิง', 'Police Corporal', 'ส.ต.ท.หญิง', 'POL.CPL.', 3, 0, 115, 'Y'),
(116, 'สิบตำรวจเอกหญิง', 'Police Sergeant', 'ส.ต.อ.หญิง', 'POL.SGT', 3, 0, 116, 'Y'),
(117, 'จ่าสิบตำรวจ', 'Police Sergeant Major', 'จ.ส.ต.', 'POL.SGT.MAJ.', 2, 0, 117, 'Y'),
(118, 'จ่าสิบตำรวจหญิง', 'Police Sergeant Major', 'จ.ส.ต.หญิง', 'POL.SGT.MAJ.', 3, 0, 118, 'Y'),
(119, 'ดาบตำรวจ', 'Police Senior Sergeant Major', 'ด.ต.', 'POL.SEN.SGT.MAJ.', 2, 0, 119, 'Y'),
(120, 'ดาบตำรวจหญิง', 'Police Senior Sergeant Major', 'ด.ต.หญิง', 'POL.SEN.SGT.MAJ.', 3, 0, 120, 'Y'),
(121, 'ร้อยตำรวจตรี', 'Police Sub-Lieutenant', 'ร.ต.ต.', 'POL.SUB.LT.', 2, 0, 121, 'Y'),
(122, 'ร้อยตำรวจโท', 'Police Lieutenant', 'ร.ต.ท.', 'POL.LT.', 2, 0, 122, 'Y'),
(123, 'ร้อยตำรวจเอก', 'Police Captain', 'ร.ต.อ.', 'POL.CAPT.', 2, 0, 123, 'Y'),
(124, 'ร้อยตำรวจตรีหญิง', 'Police Sub-Lieutenant', 'ร.ต.ต.หญิง', 'POL.SUB.LT.', 3, 0, 124, 'Y'),
(125, 'ร้อยตำรวจโทหญิง', 'Police Lieutenant', 'ร.ต.ท.หญิง', 'POL.LT.', 3, 0, 125, 'Y'),
(126, 'ร้อยตำรวจเอกหญิง', 'Police Captain', 'ร.ต.อ.หญิง', 'POL.CAPT.', 3, 0, 126, 'Y'),
(127, 'พันตำรวจตรี', 'Police Major', 'พ.ต.ต.', 'POL.MAJ.', 2, 0, 127, 'Y'),
(128, 'พันตำรวจโท', 'Police Lieutenant Colonel', 'พ.ต.ท.', 'POL.LT.COL.', 2, 0, 128, 'Y'),
(129, 'พันตำรวจเอก', 'Police Colonel', 'พ.ต.อ.', 'POL.COL.', 2, 0, 129, 'Y'),
(130, 'พันตำรวจตรีหญิง', 'Police Major', 'พ.ต.ต.หญิง', 'POL.MAJ.', 3, 0, 130, 'Y'),
(131, 'พันตำรวจโทหญิง', 'Police Lieutenant Colonel', 'พ.ต.ท.หญิง', 'POL.LT.COL.', 3, 0, 131, 'Y'),
(132, 'พันตำรวจเอกหญิง', 'Police Colonel', 'พ.ต.อ.หญิง', 'POL.COL.', 3, 0, 132, 'Y'),
(133, 'พลตำรวจตรี', 'Police Major General', 'พล.ต.ต.', 'POL.MAJ.GEN.', 2, 0, 133, 'Y'),
(134, 'พลตำรวจโท', 'Police Lieutenant General', 'พล.ต.ท.', 'POL.LT.GEN.', 2, 0, 134, 'Y'),
(135, 'พลตำรวจเอก', 'Police General', 'พล.ต.อ.', 'POL.GEN.', 2, 0, 135, 'Y'),
(136, 'พลตำรวจ', 'Policeman Constable / Police Private', 'พลฯ', 'POL.CONST.', 2, 0, 136, 'Y'),
(137, 'หม่อมเจ้า', 'His Serene Highness', 'ม.จ.', 'HSH', 2, 0, 137, 'Y'),
(138, 'หม่อมเจ้าหญิง', 'Her Serene Highness', 'ม.จ.หญิง', 'HSH', 3, 0, 138, 'Y'),
(139, 'หม่อมราชวงศ์', 'Mom Rachawong', 'ม.ร.ว.', 'M.R.', 1, 0, 139, 'Y'),
(140, 'หม่อมหลวง', 'Mom Luang', 'ม.ล.', 'M.L.', 1, 0, 140, 'Y'),
(141, 'นายแพทย์', '-', 'นพ.', '-', 2, 0, 141, 'Y'),
(142, 'แพทย์หญิง', '-', 'พญ.', '-', 3, 0, 142, 'Y'),
(143, 'ผู้ช่วยศาสตรจารย์', 'Professor assistant', 'ผศ.', '-', 1, 0, 143, 'Y'),
(144, 'ผู้ช่วยศาสตรจารย์นายแพทย์', '-', 'ผศ.นพ.', '-', 1, 0, 144, 'Y'),
(145, 'ด็อกเตอร์', 'Doctor', 'ดร.', 'Dr.', 1, 0, 145, 'Y'),
(146, 'จอมพลอากาศ', '', 'จอมพลอากาศ', 'Marshal of the Royal Thai Air Force', 1, 0, 146, 'Y'),
(147, 'จอมพล', '', 'จอมพล', 'Field Marshal', 1, 0, 147, 'Y'),
(148, 'จอมพลเรือ', '', 'จอมพลเรือ', 'Admiral of the Fleet', 1, 0, 148, 'Y'),
(149, 'พลอากาศเอก', '', 'พลอากาศเอก', 'Air Chief Marshal', 1, 0, 149, 'Y'),
(150, 'พลเอก', '', 'พลเอก', 'General', 1, 0, 150, 'Y'),
(151, 'นาวาเอก', '', 'นาวาเอก', 'Captain', 1, 0, 151, 'Y'),
(152, 'นาวาโท', '', 'นาวาโท', 'Commander', 1, 0, 152, 'Y'),
(153, 'นาวาตรี', '', 'นาวาตรี', 'Lieutenant Commander', 1, 0, 153, 'Y'),
(154, 'เรือเอก', '', 'เรือเอก', 'Lieutenant', 1, 0, 154, 'Y'),
(155, 'เรืออากาศโท', '', 'เรืออากาศโท', 'Flying Officer', 1, 0, 155, 'Y'),
(156, 'เรือโท', '', 'เรือโท', 'Lieutenant Junior Grade', 1, 0, 156, 'Y'),
(157, 'เรือตรี', '', 'เรือตรี', 'Sub Lieutenant', 1, 0, 157, 'Y'),
(158, 'พันจ่าเอก', '', 'พันจ่าเอก', 'Chief Petty Officer 1st Class', 1, 0, 158, 'Y'),
(159, 'นักเรียนนายเรืออากาศ', '', 'นักเรียนนายเรืออากาศ', 'Air Cadet', 1, 0, 159, 'Y'),
(160, 'นักเรียนนายร้อย', '', 'นักเรียนนายร้อย', 'Army Cadet', 1, 0, 160, 'Y'),
(161, 'นักเรียนนายเรือ', '', 'นักเรียนนายเรือ', 'Naval Cadet', 1, 0, 161, 'Y'),
(162, 'นักเรียนจ่าอากาศ', '', 'นักเรียนจ่าอากาศ', 'Air Technical Student', 1, 0, 162, 'Y'),
(163, 'นักเรียนนายสิบทหารบก', '', 'นักเรียนนายสิบทหารบก', 'Army Non-Commissioned Officer Student', 1, 0, 163, 'Y'),
(164, 'นักเรียนจ่าทหารเรือ', '', 'นักเรียนจ่าทหารเรือ', 'Naval Rating Student', 1, 0, 164, 'Y'),
(165, 'รองศาสตราจารย์', '-', 'รศ.', 'LS', 2, 0, 165, 'Y'),
(166, 'ศาสตราจารย์', '-', 'ศ.', '-', 1, 0, 166, 'Y'),
(167, 'เภสัชกร', '-', 'ภก.', '-', 2, 0, 167, 'Y'),
(168, 'ทันแพทย์', '', 'ทพ.', '-', 2, 0, 168, 'Y'),
(169, 'ทันตแพทย์หญิง', '', 'ทญ.', '-', 3, 0, 169, 'Y'),
(170, 'รองศาสตราจารย์ดอกเตอร์', '-', 'รศ.ดร.', '-', 1, 0, 170, 'Y'),
(171, 'ผู้ช่วยศาสตราจารย์ดอกเตอร์', '-', 'ผศ.ดร.', '-', 1, 0, 171, 'Y'),
(172, 'เรืออากาศเอกหญิงด๊อกเตอร์', 'Doctor Flight Lieutenant women', 'ร.อ.หญิง ดร.', 'Dr. Flt.Lt. women', 3, 0, 172, 'Y'),
(173, 'ผู้อํานวยการ', 'Director', 'ผอ.', 'Director', 3, 0, 173, 'Y'),
(174, 'ดร.เภสัชกรหญิง', '-', 'ดร.ภญ.', '-', 3, 0, 174, 'Y'),
(175, 'ภญ.ดร.', '-', 'ภญ.ดร.', '-', 1, 0, 175, 'Y'),
(176, 'ดร.', '-', 'ดร.', '-', 1, 0, 176, 'Y'),
(177, 'ผศ.ทพญ.', '-', 'ผศ.ทพญ.', '-', 3, 0, 177, 'Y'),
(178, 'ผศ.ทพญ.ดร.', '-', 'ผศ.ทพญ.ดร.', '-', 3, 0, 178, 'Y'),
(179, 'ผศ.ทพ.', '-', 'ผศ.ทพ.', '-', 2, 0, 179, 'Y'),
(180, 'ผศ.ทพ.ดร.', '-', 'ผศ.ทพ.ดร.', '-', 2, 0, 180, 'Y'),
(181, 'อ.พญ.ทพญ.', '-', 'อ.พญ.ทพญ.', '-', 3, 0, 181, 'Y'),
(182, 'อ.ทพญ.', '-', 'อ.ทพญ.', '-', 3, 0, 182, 'Y'),
(183, 'อ.ทพญ.ดร.', '-', 'อ.ทพญ.ดร.', '-', 3, 0, 183, 'Y'),
(184, 'อ.ทพ.', '-', 'อ.ทพ.', '-', 2, 0, 184, 'Y'),
(185, 'อ.ดร.', '-', 'อ.ดร.', '-', 1, 0, 185, 'Y'),
(186, 'ผศ.ดร.', 'Porf.Dr.', 'ผศ.ดร.', 'Porf.Dr.', 1, 0, 186, 'Y'),
(187, 'ร.อ.หญิง.ดร.', '-', 'ร.อ.หญิง.ดร.', '-', 3, 0, 187, 'Y'),
(188, 'ผศ.ดร.', 'Prof.Dr.M.', 'ผศ.ดร.', 'Prof.Dr.M.', 1, 0, 188, 'Y'),
(189, 'เภสัชกรหญิง', '-', 'ภก.หญิง', '-', 3, 0, 189, 'Y'),
(190, 'ว่าที่ร้อยเอก', 'Acting Captain', 'ว่าที่ ร.อ.', 'Acting Capt.', 2, 0, 190, 'Y'),
(191, 'ว่าที่ร้อยเอกหญิง', 'Acting Captain', 'ว่าที่ ร.อ.หญิง', 'Acting Capt.', 3, 0, 191, 'Y'),
(192, 'ว่าที่พันตรี', 'Acting Major', 'ว่าที่ พ.ต.', 'Acting Maj.', 2, 0, 192, 'Y'),
(193, 'ว่าที่พันตรีหญิง', 'Acting Major', 'ว่าที่ พ.ต.หญิง', 'Acting Maj.', 3, 0, 193, 'Y'),
(194, 'Mr.', 'Mr.', 'Mr.', 'Mr.', 2, 0, 194, 'Y'),
(195, 'Mrs.', 'Mrs.', 'Mrs.', 'Mrs.', 3, 0, 195, 'Y'),
(196, 'Ms.', 'Ms.', 'Ms.', 'Ms.', 3, 0, 196, 'Y'),
(197, 'ผู้ช่วยศาสตราจารย์ดอกเตอร์ทันตแพทย์', '-', 'ผศ.ดร.ทพ.', '-', 1, 0, 197, 'Y'),
(198, 'ศาสตราจารย์พิเศษทันตแพทย์หญิง', '-', 'ศ.พิเศษ ทพญ.', '-', 1, 0, 198, 'Y'),
(199, 'ศาสตราจารย์พิเศษทันตแพทย์', '-', 'ศ.พิเศษ ทพ.', '-', 1, 0, 199, 'Y'),
(200, 'อาจารย์', '-', 'อาจารย์', '-', 1, 0, 200, 'Y'),
(201, 'ศาสตราจารย์(เชี่ยวชาญพิเศษ) ทพ.ดร.', 'N', 'ศ.(เชี่ยวชาญพิเศษ)ทพ.ดร.', 'N', 1, 0, 201, 'Y'),
(202, 'รองศาสตราจารย์ทันตแพทย์หญิงดอกเตอร์', 'Dr.', 'รศ.ทพญ.ดร.', 'Dr.', 3, 0, 202, 'Y');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `prefix`
--
ALTER TABLE `prefix`
  ADD PRIMARY KEY (`pf_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `prefix`
--
ALTER TABLE `prefix`
  MODIFY `pf_id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'รหัส', AUTO_INCREMENT=203;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
